RIOT-OS/RIOT/cpu/StellarisWare/inc/lm4f112h5qd.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_PCTL register for
// port F.
//
//*****************************************************************************
#define GPIO_PCTL_PF7_M         0xF0000000  // PF7 mask
#define GPIO_PCTL_PF7_I2C2SDA   0x30000000  // I2C2SDA on PF7
#define GPIO_PCTL_PF7_T3CCP1    0x70000000  // T3CCP1 on PF7
#define GPIO_PCTL_PF6_M         0x0F000000  // PF6 mask
#define GPIO_PCTL_PF6_I2C2SCL   0x03000000  // I2C2SCL on PF6
#define GPIO_PCTL_PF6_T3CCP0    0x07000000  // T3CCP0 on PF6
#define GPIO_PCTL_PF5_M         0x00F00000  // PF5 mask
#define GPIO_PCTL_PF5_T2CCP1    0x00700000  // T2CCP1 on PF5
#define GPIO_PCTL_PF4_M         0x000F0000  // PF4 mask
#define GPIO_PCTL_PF4_U1DTR     0x00010000  // U1DTR on PF4
#define GPIO_PCTL_PF4_T2CCP0    0x00070000  // T2CCP0 on PF4
#define GPIO_PCTL_PF4_TRD3      0x000E0000  // TRD3 on PF4
#define GPIO_PCTL_PF3_M         0x0000F000  // PF3 mask
#define GPIO_PCTL_PF3_U1DSR     0x00001000  // U1DSR on PF3
#define GPIO_PCTL_PF3_SSI1FSS   0x00002000  // SSI1FSS on PF3
#define GPIO_PCTL_PF3_CAN0TX    0x00003000  // CAN0TX on PF3
#define GPIO_PCTL_PF3_T1CCP1    0x00007000  // T1CCP1 on PF3
#define GPIO_PCTL_PF3_TRCLK     0x0000E000  // TRCLK on PF3
#define GPIO_PCTL_PF2_M         0x00000F00  // PF2 mask
#define GPIO_PCTL_PF2_U1DCD     0x00000100  // U1DCD on PF2
#define GPIO_PCTL_PF2_SSI1CLK   0x00000200  // SSI1CLK on PF2
#define GPIO_PCTL_PF2_T1CCP0    0x00000700  // T1CCP0 on PF2
#define GPIO_PCTL_PF2_C2O       0x00000900  // C2O on PF2
#define GPIO_PCTL_PF2_TRD0      0x00000E00  // TRD0 on PF2
#define GPIO_PCTL_PF1_M         0x000000F0  // PF1 mask
#define GPIO_PCTL_PF1_U1CTS     0x00000010  // U1CTS on PF1
#define GPIO_PCTL_PF1_SSI1TX    0x00000020  // SSI1TX on PF1
#define GPIO_PCTL_PF1_T0CCP1    0x00000070  // T0CCP1 on PF1
#define GPIO_PCTL_PF1_C1O       0x00000090  // C1O on PF1
#define GPIO_PCTL_PF1_TRD1      0x000000E0  // TRD1 on PF1
#define GPIO_PCTL_PF0_M         0x0000000F  // PF0 mask
#define GPIO_PCTL_PF0_U1RTS     0x00000001  // U1RTS on PF0
#define GPIO_PCTL_PF0_SSI1RX    0x00000002  // SSI1RX on PF0
#define GPIO_PCTL_PF0_CAN0RX    0x00000003  // CAN0RX on PF0
#define GPIO_PCTL_PF0_T0CCP0    0x00000007  // T0CCP0 on PF0
#define GPIO_PCTL_PF0_NMI       0x00000008  // NMI on PF0
#define GPIO_PCTL_PF0_C0O       0x00000009  // C0O on PF0
#define GPIO_PCTL_PF0_TRD2      0x0000000E  // TRD2 on PF0

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_PCTL register for
// port G.
//
//*****************************************************************************
#define GPIO_PCTL_PG7_M         0xF0000000  // PG7 mask
#define GPIO_PCTL_PG7_I2C5SDA   0x30000000  // I2C5SDA on PG7
#define GPIO_PCTL_PG7_WT1CCP1   0x70000000  // WT1CCP1 on PG7
#define GPIO_PCTL_PG6_M         0x0F000000  // PG6 mask
#define GPIO_PCTL_PG6_I2C5SCL   0x03000000  // I2C5SCL on PG6
#define GPIO_PCTL_PG6_WT1CCP0   0x07000000  // WT1CCP0 on PG6
#define GPIO_PCTL_PG5_M         0x00F00000  // PG5 mask
#define GPIO_PCTL_PG5_U2TX      0x00100000  // U2TX on PG5
#define GPIO_PCTL_PG5_I2C1SDA   0x00300000  // I2C1SDA on PG5
#define GPIO_PCTL_PG5_WT0CCP1   0x00700000  // WT0CCP1 on PG5
#define GPIO_PCTL_PG4_M         0x000F0000  // PG4 mask
#define GPIO_PCTL_PG4_U2RX      0x00010000  // U2RX on PG4
#define GPIO_PCTL_PG4_I2C1SCL   0x00030000  // I2C1SCL on PG4
#define GPIO_PCTL_PG4_WT0CCP0   0x00070000  // WT0CCP0 on PG4
#define GPIO_PCTL_PG3_M         0x0000F000  // PG3 mask
#define GPIO_PCTL_PG3_I2C4SDA   0x00003000  // I2C4SDA on PG3
#define GPIO_PCTL_PG3_T5CCP1    0x00007000  // T5CCP1 on PG3
#define GPIO_PCTL_PG2_M         0x00000F00  // PG2 mask
#define GPIO_PCTL_PG2_I2C4SCL   0x00000300  // I2C4SCL on PG2
#define GPIO_PCTL_PG2_T5CCP0    0x00000700  // T5CCP0 on PG2
#define GPIO_PCTL_PG1_M         0x000000F0  // PG1 mask
#define GPIO_PCTL_PG1_I2C3SDA   0x00000030  // I2C3SDA on PG1
#define GPIO_PCTL_PG1_T4CCP1    0x00000070  // T4CCP1 on PG1
#define GPIO_PCTL_PG0_M         0x0000000F  // PG0 mask
#define GPIO_PCTL_PG0_I2C3SCL   0x00000003  // I2C3SCL on PG0
#define GPIO_PCTL_PG0_T4CCP0    0x00000007  // T4CCP0 on PG0

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_PCTL register for
// port H.
//
//*****************************************************************************
#define GPIO_PCTL_PH7_M         0xF0000000  // PH7 mask
#define GPIO_PCTL_PH7_SSI2TX    0x20000000  // SSI2TX on PH7
#define GPIO_PCTL_PH7_WT4CCP1   0x70000000  // WT4CCP1 on PH7
#define GPIO_PCTL_PH6_M         0x0F000000  // PH6 mask
#define GPIO_PCTL_PH6_SSI2RX    0x02000000  // SSI2RX on PH6
#define GPIO_PCTL_PH6_WT4CCP0   0x07000000  // WT4CCP0 on PH6
#define GPIO_PCTL_PH5_M         0x00F00000  // PH5 mask
#define GPIO_PCTL_PH5_SSI2FSS   0x00200000  // SSI2FSS on PH5
#define GPIO_PCTL_PH5_WT3CCP1   0x00700000  // WT3CCP1 on PH5
#define GPIO_PCTL_PH4_M         0x000F0000  // PH4 mask
#define GPIO_PCTL_PH4_SSI2CLK   0x00020000  // SSI2CLK on PH4
#define GPIO_PCTL_PH4_WT3CCP0   0x00070000  // WT3CCP0 on PH4
#define GPIO_PCTL_PH3_M         0x0000F000  // PH3 mask
#define GPIO_PCTL_PH3_SSI3TX    0x00002000  // SSI3TX on PH3
#define GPIO_PCTL_PH3_WT5CCP1   0x00007000  // WT5CCP1 on PH3
#define GPIO_PCTL_PH2_M         0x00000F00  // PH2 mask
#define GPIO_PCTL_PH2_SSI3RX    0x00000200  // SSI3RX on PH2
#define GPIO_PCTL_PH2_WT5CCP0   0x00000700  // WT5CCP0 on PH2
#define GPIO_PCTL_PH1_M         0x000000F0  // PH1 mask
#define GPIO_PCTL_PH1_SSI3FSS   0x00000020  // SSI3FSS on PH1
#define GPIO_PCTL_PH1_WT2CCP1   0x00000070  // WT2CCP1 on PH1
#define GPIO_PCTL_PH0_M         0x0000000F  // PH0 mask
#define GPIO_PCTL_PH0_SSI3CLK   0x00000002  // SSI3CLK on PH0
#define GPIO_PCTL_PH0_WT2CCP0   0x00000007  // WT2CCP0 on PH0

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_PCTL register for
// port J.
//
//*****************************************************************************
#define GPIO_PCTL_PJ7_M         0xF0000000  // PJ7 mask
#define GPIO_PCTL_PJ6_M         0x0F000000  // PJ6 mask
#define GPIO_PCTL_PJ5_M         0x00F00000  // PJ5 mask
#define GPIO_PCTL_PJ5_U6TX      0x00100000  // U6TX on PJ5
#define GPIO_PCTL_PJ5_T3CCP1    0x00700000  // T3CCP1 on PJ5
#define GPIO_PCTL_PJ4_M         0x000F0000  // PJ4 mask
#define GPIO_PCTL_PJ4_U6RX      0x00010000  // U6RX on PJ4
#define GPIO_PCTL_PJ4_T3CCP0    0x00070000  // T3CCP0 on PJ4
#define GPIO_PCTL_PJ3_M         0x0000F000  // PJ3 mask
#define GPIO_PCTL_PJ3_U5TX      0x00001000  // U5TX on PJ3
#define GPIO_PCTL_PJ3_T2CCP1    0x00007000  // T2CCP1 on PJ3
#define GPIO_PCTL_PJ2_M         0x00000F00  // PJ2 mask
#define GPIO_PCTL_PJ2_U5RX      0x00000100  // U5RX on PJ2
#define GPIO_PCTL_PJ2_T2CCP0    0x00000700  // T2CCP0 on PJ2
#define GPIO_PCTL_PJ1_M         0x000000F0  // PJ1 mask
#define GPIO_PCTL_PJ1_U4TX      0x00000010  // U4TX on PJ1
#define GPIO_PCTL_PJ1_T1CCP1    0x00000070  // T1CCP1 on PJ1
#define GPIO_PCTL_PJ0_M         0x0000000F  // PJ0 mask
#define GPIO_PCTL_PJ0_U4RX      0x00000001  // U4RX on PJ0
#define GPIO_PCTL_PJ0_T1CCP0    0x00000007  // T1CCP0 on PJ0

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_PCTL register for
// port K.
//
//*****************************************************************************
#define GPIO_PCTL_PK7_M         0xF0000000  // PK7 Mask
#define GPIO_PCTL_PK7_WT1CCP1   0x70000000  // WT1CCP1 on PK7
#define GPIO_PCTL_PK6_M         0x0F000000  // PK6 Mask
#define GPIO_PCTL_PK6_WT1CCP0   0x07000000  // WT1CCP0 on PK6
#define GPIO_PCTL_PK6_C2O       0x08000000  // C2O on PK6
#define GPIO_PCTL_PK5_M         0x00F00000  // PK5 Mask
#define GPIO_PCTL_PK5_U7TX      0x00100000  // U7TX on PK5
#define GPIO_PCTL_PK5_C1O       0x00800000  // C1O on PK5
#define GPIO_PCTL_PK4_M         0x000F0000  // PK4 Mask
#define GPIO_PCTL_PK4_U7RX      0x00010000  // U7RX on PK4
#define GPIO_PCTL_PK4_RTCCLK    0x00070000  // RTCCLK on PK4
#define GPIO_PCTL_PK4_C0O       0x00080000  // C0O on PK4
#define GPIO_PCTL_PK3_M         0x0000F000  // PK3 Mask
#define GPIO_PCTL_PK3_SSI3TX    0x00002000  // SSI3TX on PK3
#define GPIO_PCTL_PK2_M         0x00000F00  // PK2 Mask
#define GPIO_PCTL_PK2_SSI3RX    0x00000200  // SSI3RX on PK2
#define GPIO_PCTL_PK1_M         0x000000F0  // PK1 Mask
#define GPIO_PCTL_PK1_SSI3FSS   0x00000020  // SSI3FSS on PK1
#define GPIO_PCTL_PK0_M         0x0000000F  // PK0 Mask
#define GPIO_PCTL_PK0_SSI3CLK   0x00000002  // SSI3CLK on PK0

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_PCTL register for
// port L.
//
//*****************************************************************************
#define GPIO_PCTL_PL7_M         0xF0000000  // PL7 Mask
#define GPIO_PCTL_PL7_T3CCP1    0x70000000  // T3CCP1 on PL7
#define GPIO_PCTL_PL7_WT3CCP1   0x80000000  // WT3CCP1 on PL7
#define GPIO_PCTL_PL6_M         0x0F000000  // PL6 Mask
#define GPIO_PCTL_PL6_T3CCP0    0x07000000  // T3CCP0 on PL6
#define GPIO_PCTL_PL6_WT3CCP0   0x08000000  // WT3CCP0 on PL6
#define GPIO_PCTL_PL5_M         0x00F00000  // PL5 Mask
#define GPIO_PCTL_PL5_T2CCP1    0x00700000  // T2CCP1 on PL5
#define GPIO_PCTL_PL5_WT2CCP1   0x00800000  // WT2CCP1 on PL5
#define GPIO_PCTL_PL5_LPC0RESET_N \
                                0x00F00000  // LPC0RESET_N on PL5
#define GPIO_PCTL_PL4_M         0x000F0000  // PL4 Mask
#define GPIO_PCTL_PL4_T2CCP0    0x00070000  // T2CCP0 on PL4
#define GPIO_PCTL_PL4_WT2CCP0   0x00080000  // WT2CCP0 on PL4
#define GPIO_PCTL_PL4_LPC0FRAME_N \
                                0x000F0000  // LPC0FRAME_N on PL4
#define GPIO_PCTL_PL3_M         0x0000F000  // PL3 Mask
#define GPIO_PCTL_PL3_T1CCP1    0x00007000  // T1CCP1 on PL3
#define GPIO_PCTL_PL3_WT1CCP1   0x00008000  // WT1CCP1 on PL3
#define GPIO_PCTL_PL2_M         0x00000F00  // PL2 Mask
#define GPIO_PCTL_PL2_T1CCP0    0x00000700  // T1CCP0 on PL2
#define GPIO_PCTL_PL2_WT1CCP0   0x00000800  // WT1CCP0 on PL2
#define GPIO_PCTL_PL1_M         0x000000F0  // PL1 Mask
#define GPIO_PCTL_PL1_T0CCP1    0x00000070  // T0CCP1 on PL1
#define GPIO_PCTL_PL1_WT0CCP1   0x00000080  // WT0CCP1 on PL1
#define GPIO_PCTL_PL0_M         0x0000000F  // PL0 Mask
#define GPIO_PCTL_PL0_T0CCP0    0x00000007  // T0CCP0 on PL0
#define GPIO_PCTL_PL0_WT0CCP0   0x00000008  // WT0CCP0 on PL0

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_PCTL register for
// port M.
//
//*****************************************************************************
#define GPIO_PCTL_PM7_M         0xF0000000  // PM7 Mask
#define GPIO_PCTL_PM7_WT0CCP1   0x70000000  // WT0CCP1 on PM7
#define GPIO_PCTL_PM6_M         0x0F000000  // PM6 Mask
#define GPIO_PCTL_PM6_WT0CCP0   0x07000000  // WT0CCP0 on PM6
#define GPIO_PCTL_PM5_M         0x00F00000  // PM5 Mask
#define GPIO_PCTL_PM4_M         0x000F0000  // PM4 Mask
#define GPIO_PCTL_PM3_M         0x0000F000  // PM3 Mask
#define GPIO_PCTL_PM3_T5CCP1    0x00007000  // T5CCP1 on PM3
#define GPIO_PCTL_PM3_WT5CCP1   0x00008000  // WT5CCP1 on PM3
#define GPIO_PCTL_PM2_M         0x00000F00  // PM2 Mask
#define GPIO_PCTL_PM2_T5CCP0    0x00000700  // T5CCP0 on PM2
#define GPIO_PCTL_PM2_WT5CCP0   0x00000800  // WT5CCP0 on PM2
#define GPIO_PCTL_PM2_LPC0CLKRUN_N \
                                0x00000F00  // LPC0CLKRUN_N on PM2
#define GPIO_PCTL_PM1_M         0x000000F0  // PM1 Mask
#define GPIO_PCTL_PM1_T4CCP1    0x00000070  // T4CCP1 on PM1
#define GPIO_PCTL_PM1_WT4CCP1   0x00000080  // WT4CCP1 on PM1
#define GPIO_PCTL_PM1_LPC0SCI_N 0x000000F0  // LPC0SCI_N on PM1
#define GPIO_PCTL_PM0_M         0x0000000F  // PM0 Mask
#define GPIO_PCTL_PM0_T4CCP0    0x00000007  // T4CCP0 on PM0
#define GPIO_PCTL_PM0_WT4CCP0   0x00000008  // WT4CCP0 on PM0
#define GPIO_PCTL_PM0_LPC0PD_N  0x0000000F  // LPC0PD_N on PM0

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_PCTL register for
// port N.
//
//*****************************************************************************
#define GPIO_PCTL_PN7_M         0xF0000000  // PN7 Mask
#define GPIO_PCTL_PN7_WT4CCP1   0x70000000  // WT4CCP1 on PN7
#define GPIO_PCTL_PN6_M         0x0F000000  // PN6 Mask
#define GPIO_PCTL_PN6_WT4CCP0   0x07000000  // WT4CCP0 on PN6
#define GPIO_PCTL_PN5_M         0x00F00000  // PN5 Mask
#define GPIO_PCTL_PN5_WT3CCP1   0x00700000  // WT3CCP1 on PN5
#define GPIO_PCTL_PN4_M         0x000F0000  // PN4 Mask
#define GPIO_PCTL_PN4_WT3CCP0   0x00070000  // WT3CCP0 on PN4
#define GPIO_PCTL_PN3_M         0x0000F000  // PN3 Mask
#define GPIO_PCTL_PN3_WT2CCP1   0x00007000  // WT2CCP1 on PN3
#define GPIO_PCTL_PN2_M         0x00000F00  // PN2 Mask
#define GPIO_PCTL_PN2_WT2CCP0   0x00000700  // WT2CCP0 on PN2
#define GPIO_PCTL_PN1_M         0x000000F0  // PN1 Mask
#define GPIO_PCTL_PN1_CAN0TX    0x00000010  // CAN0TX on PN1
#define GPIO_PCTL_PN0_M         0x0000000F  // PN0 Mask
#define GPIO_PCTL_PN0_CAN0RX    0x00000001  // CAN0RX on PN0

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_PCTL register for
// port P.
//
//*****************************************************************************
#define GPIO_PCTL_PP2_M         0x00000F00  // PP2 Mask
#define GPIO_PCTL_PP2_T5CCP0    0x00000700  // T5CCP0 on PP2
#define GPIO_PCTL_PP1_M         0x000000F0  // PP1 Mask
#define GPIO_PCTL_PP1_T4CCP1    0x00000070  // T4CCP1 on PP1
#define GPIO_PCTL_PP0_M         0x0000000F  // PP0 Mask
#define GPIO_PCTL_PP0_T4CCP0    0x00000007  // T4CCP0 on PP0

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_CR0 register.
//
//*****************************************************************************
#define SSI_CR0_SCR_M           0x0000FF00  // SSI Serial Clock Rate
#define SSI_CR0_SPH             0x00000080  // SSI Serial Clock Phase
#define SSI_CR0_SPO             0x00000040  // SSI Serial Clock Polarity
#define SSI_CR0_FRF_M           0x00000030  // SSI Frame Format Select
#define SSI_CR0_FRF_MOTO        0x00000000  // Freescale SPI Frame Format
#define SSI_CR0_FRF_TI          0x00000010  // Texas Instruments Synchronous
                                            // Serial Frame Format
#define SSI_CR0_FRF_NMW         0x00000020  // MICROWIRE Frame Format
#define SSI_CR0_DSS_M           0x0000000F  // SSI Data Size Select
#define SSI_CR0_DSS_4           0x00000003  // 4-bit data
#define SSI_CR0_DSS_5           0x00000004  // 5-bit data
#define SSI_CR0_DSS_6           0x00000005  // 6-bit data
#define SSI_CR0_DSS_7           0x00000006  // 7-bit data
#define SSI_CR0_DSS_8           0x00000007  // 8-bit data
#define SSI_CR0_DSS_9           0x00000008  // 9-bit data
#define SSI_CR0_DSS_10          0x00000009  // 10-bit data
#define SSI_CR0_DSS_11          0x0000000A  // 11-bit data
#define SSI_CR0_DSS_12          0x0000000B  // 12-bit data
#define SSI_CR0_DSS_13          0x0000000C  // 13-bit data
#define SSI_CR0_DSS_14          0x0000000D  // 14-bit data
#define SSI_CR0_DSS_15          0x0000000E  // 15-bit data
#define SSI_CR0_DSS_16          0x0000000F  // 16-bit data
#define SSI_CR0_SCR_S           8

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_CR1 register.
//
//*****************************************************************************
#define SSI_CR1_EOT             0x00000010  // End of Transmission
#define SSI_CR1_SOD             0x00000008  // SSI Slave Mode Output Disable
#define SSI_CR1_MS              0x00000004  // SSI Master/Slave Select
#define SSI_CR1_SSE             0x00000002  // SSI Synchronous Serial Port
                                            // Enable
#define SSI_CR1_LBM             0x00000001  // SSI Loopback Mode

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_DR register.
//
//*****************************************************************************
#define SSI_DR_DATA_M           0x0000FFFF  // SSI Receive/Transmit Data
#define SSI_DR_DATA_S           0

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_SR register.
//
//*****************************************************************************
#define SSI_SR_BSY              0x00000010  // SSI Busy Bit
#define SSI_SR_RFF              0x00000008  // SSI Receive FIFO Full
#define SSI_SR_RNE              0x00000004  // SSI Receive FIFO Not Empty
#define SSI_SR_TNF              0x00000002  // SSI Transmit FIFO Not Full
#define SSI_SR_TFE              0x00000001  // SSI Transmit FIFO Empty

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_CPSR register.
//
//*****************************************************************************
#define SSI_CPSR_CPSDVSR_M      0x000000FF  // SSI Clock Prescale Divisor
#define SSI_CPSR_CPSDVSR_S      0

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_IM register.
//
//*****************************************************************************
#define SSI_IM_TXIM             0x00000008  // SSI Transmit FIFO Interrupt Mask
#define SSI_IM_RXIM             0x00000004  // SSI Receive FIFO Interrupt Mask
#define SSI_IM_RTIM             0x00000002  // SSI Receive Time-Out Interrupt
                                            // Mask
#define SSI_IM_RORIM            0x00000001  // SSI Receive Overrun Interrupt
                                            // Mask

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_RIS register.
//
//*****************************************************************************
#define SSI_RIS_TXRIS           0x00000008  // SSI Transmit FIFO Raw Interrupt
                                            // Status
#define SSI_RIS_RXRIS           0x00000004  // SSI Receive FIFO Raw Interrupt
                                            // Status
#define SSI_RIS_RTRIS           0x00000002  // SSI Receive Time-Out Raw
                                            // Interrupt Status
#define SSI_RIS_RORRIS          0x00000001  // SSI Receive Overrun Raw
                                            // Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_MIS register.
//
//*****************************************************************************
#define SSI_MIS_TXMIS           0x00000008  // SSI Transmit FIFO Masked
                                            // Interrupt Status
#define SSI_MIS_RXMIS           0x00000004  // SSI Receive FIFO Masked
                                            // Interrupt Status
#define SSI_MIS_RTMIS           0x00000002  // SSI Receive Time-Out Masked
                                            // Interrupt Status
#define SSI_MIS_RORMIS          0x00000001  // SSI Receive Overrun Masked
                                            // Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_ICR register.
//
//*****************************************************************************
#define SSI_ICR_RTIC            0x00000002  // SSI Receive Time-Out Interrupt
                                            // Clear
#define SSI_ICR_RORIC           0x00000001  // SSI Receive Overrun Interrupt
                                            // Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_DMACTL register.
//
//*****************************************************************************
#define SSI_DMACTL_TXDMAE       0x00000002  // Transmit DMA Enable
#define SSI_DMACTL_RXDMAE       0x00000001  // Receive DMA Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_CC register.
//
//*****************************************************************************
#define SSI_CC_CS_M             0x0000000F  // SSI Baud Clock Source
#define SSI_CC_CS_SYSPLL        0x00000000  // Either the system clock (if the
                                            // PLL bypass is in effect) or the
                                            // PLL output (default)
#define SSI_CC_CS_PIOSC         0x00000005  // PIOSC

//*****************************************************************************
//
// The following are defines for the bit fields in the UART_O_DR register.
//
//*****************************************************************************
#define UART_DR_OE              0x00000800  // UART Overrun Error
#define UART_DR_BE              0x00000400  // UART Break Error
#define UART_DR_PE              0x00000200  // UART Parity Error
#define UART_DR_FE              0x00000100  // UART Framing Error
#define UART_DR_DATA_M          0x000000FF  // Data Transmitted or Received
#define UART_DR_DATA_S          0

//*****************************************************************************
//
// The following are defines for the bit fields in the UART_O_RSR register.
//
//*****************************************************************************
#define UART_RSR_OE             0x00000008  // UART Overrun Error
#define UART_RSR_BE             0x00000004  // UART Break Error
#define UART_RSR_PE             0x00000002  // UART Parity Error
#define UART_RSR_FE             0x00000001  // UART Framing Error

//*****************************************************************************
//
// The following are defines for the bit fields in the UART_O_ECR register.
//
//*****************************************************************************
#define UART_ECR_DATA_M         0x000000FF  // Error Clear
#define UART_ECR_DATA_S         0

